Jin-314/MusicRelay_STM32/Core/Inc/main.h
/* USER CODE BEGIN Header */
/**
  ******************************************************************************
  * @file           : main.h
  * @brief          : Header for main.c file.
  *                   This file contains the common defines of the application.
  ******************************************************************************
  * @attention
  *
  * <h2><center>&copy; Copyright (c) 2021 STMicroelectronics.
  * All rights reserved.</center></h2>
  *
  * This software component is licensed by ST under BSD 3-Clause license,
  * the "License"; You may not use this file except in compliance with the
  * License. You may obtain a copy of the License at:
  *                        opensource.org/licenses/BSD-3-Clause
  *
  ******************************************************************************
  */
/* USER CODE END Header */

/* Define to prevent recursive inclusion -------------------------------------*/
#ifndef __MAIN_H
#define __MAIN_H

#ifdef __cplusplus
extern "C" {
#endif

/* Includes ------------------------------------------------------------------*/
#include "stm32f3xx_hal.h"

/* Private includes ----------------------------------------------------------*/
/* USER CODE BEGIN Includes */

/* USER CODE END Includes */

/* Exported types ------------------------------------------------------------*/
/* USER CODE BEGIN ET */

/* USER CODE END ET */

/* Exported constants --------------------------------------------------------*/
/* USER CODE BEGIN EC */

/* USER CODE END EC */

/* Exported macro ------------------------------------------------------------*/
/* USER CODE BEGIN EM */

/* USER CODE END EM */

/* Exported functions prototypes ---------------------------------------------*/
void Error_Handler(void);

/* USER CODE BEGIN EFP */

/* USER CODE END EFP */

/* Private defines -----------------------------------------------------------*/
#define Relay6_Pin GPIO_PIN_0
#define Relay6_GPIO_Port GPIOF
#define Relay7_Pin GPIO_PIN_1
#define Relay7_GPIO_Port GPIOF
#define Relay2_Pin GPIO_PIN_0
#define Relay2_GPIO_Port GPIOB
#define Relay5_Pin GPIO_PIN_1
#define Relay5_GPIO_Port GPIOB
#define Relay8_Pin GPIO_PIN_8
#define Relay8_GPIO_Port GPIOA
#define Relay9_Pin GPIO_PIN_11
#define Relay9_GPIO_Port GPIOA
#define Relay1_Pin GPIO_PIN_12
#define Relay1_GPIO_Port GPIOA
#define LED_Pin GPIO_PIN_3
#define LED_GPIO_Port GPIOB
#define Relay10_Pin GPIO_PIN_5
#define Relay10_GPIO_Port GPIOB
#define Relay4_Pin GPIO_PIN_6
#define Relay4_GPIO_Port GPIOB
#define Relay3_Pin GPIO_PIN_7
#define Relay3_GPIO_Port GPIOB
/* USER CODE BEGIN Private defines */

/* USER CODE END Private defines */

#ifdef __cplusplus
}
#endif

#endif /* __MAIN_H */

/************************ (C) COPYRIGHT STMicroelectronics *****END OF FILE****/
